 {"main": {
        "name": "Stephen Puthenpurackal",
        "occupation": "Software Developer, Software Engineeer, Computer Science Student",
        "description": "Learning and developing on the web while engineering and fabricating in life.",
        "image": "profilepic.png",
        "bio": "As a skilled and experienced web developer and maker, I am excited to bring my unique combination of technical skills and background in fabrication to your team. My long-term goal is to create innovative and intelligent products by combining my coding and fabrication skills, and I am eager to apply these skills to new challenges and opportunities. I look forward to discussing how my skills and experiences can benefit your team and help drive success.",
        "contactmessage": "I am excited to discuss how my skills and experiences can benefit your team and help drive success. Feel free to contact me via phone, email, or text to learn more",
        "email": "puthenpurackalstephen@gmail.com.com",
        "phone": "469-735-7590",
        "address": {
          "street": "Dandelion Dr",
          "city": "Mesquite",
          "state": "TX",
          "zip": "75149"
        },
        "website": "github.com/datfoosteve",
        "resumedownload": "'#resumedownload'",
        "social": [
          {
            "network": "linkedin",
            "link": "https://www.linkedin.com/Puthenpurackalstephen",
            "pic": "linkedin.svg"
          },
          {
            "network": "github",
            "link": "https://github.com/datfoosteve",
            "pic": "github.svg"
          },
          {
            "network": "figma",
            "link": "https://www.figma.com/@DaedalusDesigns",
            "pic": "figma.svg"
          },
          {
            "network": "dribbble",
            "link": "https://dribbble.com/PuthenpurackalStephen",
            "pic": "dribbble.svg"
          },
          {
            "network": "codepen",
            "link": "https://codepen.io/datfoosteve",
            "pic": "codepen.svg"
          },
          {
            "network": "wakatime",
            "link": "https://wakatime.com/@datfoosteve",
            "pic": "wakatime.svg"
          }
        ]
      },
      "resume": {
        "skillmessage": "Experience with : ",
        "education": [
          {
            "school": "Midwestern State University, Wichita Falls, TX",
            "degree": "Bachelor's Degree in Science, Computer Science",
            "graduated": "Dec 2020",
            "description": "Bachelor's Degree in Science, Computer Science, Students learn the fundamentals of computer science, including data structures, algorithms, and programming languages."
          },
          {
            "school": "SMU Full Stack Engineering Bootcamp, Dallas, TX",
            "graduated": "Dec 2022",
            "description": "Full Stack Web Development, Students learn the fundamentals of web development, including HTML, CSS, JavaScript, jQuery, Bootstrap, Node.js, Express.js, MySQL, MongoDB, React, and more."
          }
        ],
        "work": [
          {
            "company": "Momenta Tech",
            "title": "Web Developer",
            "years": "2021-2022",
            "description": "Worked On PunchListZero, A wordpress website, helped manage SEO and helped with the Mail system by initializing a google SMTP server to replace Mailchimp"
          },
          {
            "company": "CVS Pharmacy",
            "title": "Pharmacy Technician",
            "years": "2",
            "description": "Counted, measured, and compounded medications following standard procedures.Located and measured medications according to prescription information, making modifications as instructed by pharmacists and providers"
          },
          {
            "company": "La Quinta Inn & Suites",
            "title": "Front Desk Receptionist",
            "years": "2",
            "description": "Worked together with staff to accomodate customers"
          },
          {
            "company": "St Francis Speciality clinic and OBGYN",
            "title": "Data Entry Technician",
            "years": "May 2010 – March 2011",
            "description": "Scanned documents and saved in database to keep records of essential organizational information."
          },
          {
            "company": "At&t Service Contractor",
            "title": "Contractor",
            "years": "2016",
            "description": "Worked with a Team to diagnose the Wi-Fi constraints at the Texas A&M Campus. Ran Several Tests checking latency on rooftop building and exteriors. Gathered enough data to locate the stress points in the network and applied commercial network repeaters at those locations."
          }
        ],
        "skills": [
          {
            "name": "React",
            "src": "react.svg",
            "url": "https://reactjs.org/docs/getting-started.html"
          },
          {
            "name": "Next",
            "src": "next.svg",
            "url": "https://nextjs.org/docs"
          },
          {
            "name": "Apollo",
            "src": "apollo.svg",
            "url": "https://www.apollographql.com/docs/apollo-server/"
          },
          {
            "name": "Graphql",
            "src": "graphql.svg",
            "url": "https://graphql.org/graphql-js/"
          },
          {
            "name": "Tailwind",
            "src": "tailwind.svg",
            "url": "https://tailwindcss.com/docs/installation"
          },
          {
            "name": "Typescript",
            "src": "ts.svg",
            "url": "https://www.typescriptlang.org/docs/"
          },
          {
            "name": "Nodejs",
            "src": "node.svg",
            "url": "https://nodejs.org/en/docs/guides/getting-started-guide/"
          },
          {
            "name": "Ethereum",
            "src": "ethereum.svg",
            "url": "https://ethereum.org/en/"
          },
          {
            "name": "Solidity",
            "src": "solidity.svg",
            "url": "https://docs.soliditylang.org/en/v0.8.13/"
          },
          {
            "name": "Firebase",
            "src": "firebase.svg",
            "url": "https://firebase.google.com/"
          },
          {
            "name": "Oauth",
            "src": "oauth.svg",
            "url": "https://oauth.net/getting-started/"
          },
          {
            "name": "Javascript",
            "src": "js.svg",
            "url": "https://www.javascript.com/"
          }
        ],
        "certificates": [
          {
            "name": "Full Stack Web Development",
            "src": "odyssey-cert.png",
            "url": "https://www.credly.com/go/osrkvKKi"
          }
        ]
      },
    
      "portfolio": {
        "projects": [
          {
            "title": "Lyrical Hackers - Musical Artist Search Engine",
            "description": "This website allowed a user to search for their favorite artist’s albums, songs, and upcoming events. In doing so, the user would be taken to external links that would allow him or her to explore the album, find lyrics to their favorite songs, or buy tickets to the next concert.",
            "category": "Bootstrap, Moment, server-side API's, Google Fonts, HTML, CSS, JavaScript",
            "image": "LyricalHackers.gif",
            "url": "HTTPS://COLINMCHALE.GITHUB.IO/PROJECTFORHACKERS"
          },
          {
            "title": "JATE",
            "description": "This program is a text editor that runs in a browser window. It is a single application that meets the PWA(Progressive Web Application) criteria and features a number of data persistence techniques that can also serves as redundancy, in such that, when a browser doesn’t support it. In other words, this application will function offline.This application consists of methods that are used for retrieving and storing data to an IndexedDB database, and uses a package called idb. The package idb is a lightweight wrapper which is used in tandem with the indexedDB API and database. The API used for storing and retrieving data is also used by companies like Google and Mozilla.",
            "category": "Progressive Web APP",
            "image": "JATE.gif",
            "url": "HTTPS://TEXT-JEDITOR.HEROKUAPP.COM/"
          },
          {
            "title": "Weatherstein",
            "description": "The WeatherApi is a weather application that utilizes an open weather API to provide real-time weather information for the user's location or any specified city. The user interface displays current weather conditions such as temperature, humidity, and wind speed, as well as a 5-day forecast. The application also allows the user to switch between Celsius and Fahrenheit and search for any city weather. It demonstrates proficiency in using React.js and integrating APIs to create a functional and user-friendly weather application.",
            "category": "SPA - Weather API, React.js, Bootstrap, HTML, CSS, JavaScript",
            "image": "Weatherstein.gif",
            "url": "https://github.com/datfoosteve"
          },
          {
            "title": "Social-Network",
            "description": "The Social-Network-API repository is a server-side project that implements the backend for a social network application. It uses Node.js and Express.js to handle server-side logic, routing, and API endpoints. The project uses MongoDB as the database and Mongoose as the Object Document Mapper(ODM) to interact with the database. It also uses JSON Web Token (JWT) for user authentication and authorization. The project exposes a set of RESTful API endpoints to handle user registration, login, posting, and other social network functionality. Overall, it's a well-structured and secure backend for a social network application built using popular technologies like Node.js, Express.js, MongoDB, Mongoose and JWT.",
            "category": "Backend API",
            "image": "SocialNetwork.gif",
            "url": "https://github.com/datfoosteve"
          }
        ]
      },
      "testimonials": {
        "testimonials": [
          {
            "text": "As the CEO of Momenta Tech, I have had the pleasure of working with Stephen on the development, maintenance, and deployment of our company website, PunchListZero. Using WordPress, Stephen played a crucial role in ensuring that our website was user-friendly, visually appealing, and consistently updated with new content. Stephen is an extremely talented and reliable developer who consistently delivers high-quality work. I highly recommend Stephen for any web development projects and am confident that He will exceed expectations.",
            "user": "Travis Z"
          },
          {
            "text": "Stephen Puthenpurackal is an outstanding student, I had the pleasure of teaching him in my classes at Midwestern State University. He displayed a remarkable level of improvement throughout the course, starting from struggling to grasp the material to excelling in all of his assignments and exams. He demonstrated a strong work ethic and determination to succeed, which is evident in his exceptional performance. He was always eager to learn and improve, and his hard work paid off as he became one of the top students in the class. I have no doubt that Stephen will be a valuable asset to any team or organization he joins in the future.",
            "user": "Dr Bernard - Professor as Midwestern State University"
          },
          {
            "text": "Stephen is a hardworking and dedicated professional. I had the pleasure of working with Stephen on a project and I was impressed with their ability to understand the requirements, their attention to detail, and their ability to communicate and collaborate with the team. They were always willing to lend a hand and go the extra mile to ensure the success of the project. Their technical skills and their ability to think outside the box made them a valuable asset to the teamI would not hesitate to recommend Stephen for any project, as they have proven to be a dedicated and hardworking professional, with exceptional technical skills, attention to detail and ability to collaborate effectively with the team.",
            "user": "Sam Thomas"
          }
        ]
      }
    }
    